WaveGlow(
  (upsample): ConvTranspose1d(80, 80, kernel_size=(1024,), stride=(256,))
  (WN): ModuleList(
    (0): WN(
      (in_layers): ModuleList(
        (0): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(1,))
        (1): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(2,), dilation=(2,))
        (2): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(4,), dilation=(4,))
        (3): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(8,), dilation=(8,))
        (4): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(16,), dilation=(16,))
        (5): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(32,), dilation=(32,))
        (6): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(64,), dilation=(64,))
        (7): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(128,), dilation=(128,))
      )
      (res_skip_layers): ModuleList(
        (0): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (1): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (2): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (3): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (4): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (5): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (6): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (7): Conv1d(512, 512, kernel_size=(1,), stride=(1,))
      )
      (cond_layers): ModuleList(
        (0): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (1): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (2): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (3): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (4): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (5): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (6): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (7): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
      )
      (start): Conv1d(4, 512, kernel_size=(1,), stride=(1,))
      (end): Conv1d(512, 8, kernel_size=(1,), stride=(1,))
    )
    (1): WN(
      (in_layers): ModuleList(
        (0): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(1,))
        (1): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(2,), dilation=(2,))
        (2): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(4,), dilation=(4,))
        (3): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(8,), dilation=(8,))
        (4): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(16,), dilation=(16,))
        (5): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(32,), dilation=(32,))
        (6): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(64,), dilation=(64,))
        (7): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(128,), dilation=(128,))
      )
      (res_skip_layers): ModuleList(
        (0): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (1): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (2): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (3): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (4): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (5): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (6): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (7): Conv1d(512, 512, kernel_size=(1,), stride=(1,))
      )
      (cond_layers): ModuleList(
        (0): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (1): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (2): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (3): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (4): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (5): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (6): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (7): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
      )
      (start): Conv1d(4, 512, kernel_size=(1,), stride=(1,))
      (end): Conv1d(512, 8, kernel_size=(1,), stride=(1,))
    )
    (2): WN(
      (in_layers): ModuleList(
        (0): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(1,))
        (1): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(2,), dilation=(2,))
        (2): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(4,), dilation=(4,))
        (3): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(8,), dilation=(8,))
        (4): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(16,), dilation=(16,))
        (5): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(32,), dilation=(32,))
        (6): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(64,), dilation=(64,))
        (7): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(128,), dilation=(128,))
      )
      (res_skip_layers): ModuleList(
        (0): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (1): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (2): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (3): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (4): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (5): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (6): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (7): Conv1d(512, 512, kernel_size=(1,), stride=(1,))
      )
      (cond_layers): ModuleList(
        (0): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (1): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (2): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (3): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (4): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (5): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (6): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (7): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
      )
      (start): Conv1d(4, 512, kernel_size=(1,), stride=(1,))
      (end): Conv1d(512, 8, kernel_size=(1,), stride=(1,))
    )
    (3): WN(
      (in_layers): ModuleList(
        (0): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(1,))
        (1): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(2,), dilation=(2,))
        (2): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(4,), dilation=(4,))
        (3): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(8,), dilation=(8,))
        (4): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(16,), dilation=(16,))
        (5): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(32,), dilation=(32,))
        (6): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(64,), dilation=(64,))
        (7): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(128,), dilation=(128,))
      )
      (res_skip_layers): ModuleList(
        (0): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (1): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (2): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (3): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (4): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (5): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (6): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (7): Conv1d(512, 512, kernel_size=(1,), stride=(1,))
      )
      (cond_layers): ModuleList(
        (0): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (1): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (2): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (3): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (4): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (5): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (6): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (7): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
      )
      (start): Conv1d(4, 512, kernel_size=(1,), stride=(1,))
      (end): Conv1d(512, 8, kernel_size=(1,), stride=(1,))
    )
    (4): WN(
      (in_layers): ModuleList(
        (0): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(1,))
        (1): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(2,), dilation=(2,))
        (2): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(4,), dilation=(4,))
        (3): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(8,), dilation=(8,))
        (4): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(16,), dilation=(16,))
        (5): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(32,), dilation=(32,))
        (6): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(64,), dilation=(64,))
        (7): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(128,), dilation=(128,))
      )
      (res_skip_layers): ModuleList(
        (0): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (1): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (2): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (3): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (4): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (5): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (6): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (7): Conv1d(512, 512, kernel_size=(1,), stride=(1,))
      )
      (cond_layers): ModuleList(
        (0): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (1): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (2): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (3): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (4): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (5): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (6): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (7): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
      )
      (start): Conv1d(3, 512, kernel_size=(1,), stride=(1,))
      (end): Conv1d(512, 6, kernel_size=(1,), stride=(1,))
    )
    (5): WN(
      (in_layers): ModuleList(
        (0): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(1,))
        (1): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(2,), dilation=(2,))
        (2): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(4,), dilation=(4,))
        (3): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(8,), dilation=(8,))
        (4): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(16,), dilation=(16,))
        (5): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(32,), dilation=(32,))
        (6): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(64,), dilation=(64,))
        (7): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(128,), dilation=(128,))
      )
      (res_skip_layers): ModuleList(
        (0): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (1): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (2): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (3): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (4): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (5): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (6): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (7): Conv1d(512, 512, kernel_size=(1,), stride=(1,))
      )
      (cond_layers): ModuleList(
        (0): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (1): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (2): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (3): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (4): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (5): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (6): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (7): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
      )
      (start): Conv1d(3, 512, kernel_size=(1,), stride=(1,))
      (end): Conv1d(512, 6, kernel_size=(1,), stride=(1,))
    )
    (6): WN(
      (in_layers): ModuleList(
        (0): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(1,))
        (1): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(2,), dilation=(2,))
        (2): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(4,), dilation=(4,))
        (3): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(8,), dilation=(8,))
        (4): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(16,), dilation=(16,))
        (5): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(32,), dilation=(32,))
        (6): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(64,), dilation=(64,))
        (7): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(128,), dilation=(128,))
      )
      (res_skip_layers): ModuleList(
        (0): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (1): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (2): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (3): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (4): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (5): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (6): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (7): Conv1d(512, 512, kernel_size=(1,), stride=(1,))
      )
      (cond_layers): ModuleList(
        (0): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (1): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (2): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (3): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (4): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (5): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (6): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (7): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
      )
      (start): Conv1d(3, 512, kernel_size=(1,), stride=(1,))
      (end): Conv1d(512, 6, kernel_size=(1,), stride=(1,))
    )
    (7): WN(
      (in_layers): ModuleList(
        (0): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(1,))
        (1): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(2,), dilation=(2,))
        (2): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(4,), dilation=(4,))
        (3): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(8,), dilation=(8,))
        (4): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(16,), dilation=(16,))
        (5): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(32,), dilation=(32,))
        (6): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(64,), dilation=(64,))
        (7): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(128,), dilation=(128,))
      )
      (res_skip_layers): ModuleList(
        (0): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (1): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (2): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (3): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (4): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (5): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (6): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (7): Conv1d(512, 512, kernel_size=(1,), stride=(1,))
      )
      (cond_layers): ModuleList(
        (0): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (1): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (2): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (3): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (4): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (5): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (6): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (7): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
      )
      (start): Conv1d(3, 512, kernel_size=(1,), stride=(1,))
      (end): Conv1d(512, 6, kernel_size=(1,), stride=(1,))
    )
    (8): WN(
      (in_layers): ModuleList(
        (0): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(1,))
        (1): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(2,), dilation=(2,))
        (2): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(4,), dilation=(4,))
        (3): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(8,), dilation=(8,))
        (4): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(16,), dilation=(16,))
        (5): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(32,), dilation=(32,))
        (6): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(64,), dilation=(64,))
        (7): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(128,), dilation=(128,))
      )
      (res_skip_layers): ModuleList(
        (0): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (1): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (2): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (3): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (4): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (5): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (6): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (7): Conv1d(512, 512, kernel_size=(1,), stride=(1,))
      )
      (cond_layers): ModuleList(
        (0): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (1): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (2): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (3): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (4): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (5): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (6): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (7): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
      )
      (start): Conv1d(2, 512, kernel_size=(1,), stride=(1,))
      (end): Conv1d(512, 4, kernel_size=(1,), stride=(1,))
    )
    (9): WN(
      (in_layers): ModuleList(
        (0): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(1,))
        (1): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(2,), dilation=(2,))
        (2): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(4,), dilation=(4,))
        (3): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(8,), dilation=(8,))
        (4): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(16,), dilation=(16,))
        (5): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(32,), dilation=(32,))
        (6): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(64,), dilation=(64,))
        (7): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(128,), dilation=(128,))
      )
      (res_skip_layers): ModuleList(
        (0): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (1): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (2): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (3): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (4): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (5): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (6): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (7): Conv1d(512, 512, kernel_size=(1,), stride=(1,))
      )
      (cond_layers): ModuleList(
        (0): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (1): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (2): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (3): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (4): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (5): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (6): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (7): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
      )
      (start): Conv1d(2, 512, kernel_size=(1,), stride=(1,))
      (end): Conv1d(512, 4, kernel_size=(1,), stride=(1,))
    )
    (10): WN(
      (in_layers): ModuleList(
        (0): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(1,))
        (1): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(2,), dilation=(2,))
        (2): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(4,), dilation=(4,))
        (3): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(8,), dilation=(8,))
        (4): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(16,), dilation=(16,))
        (5): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(32,), dilation=(32,))
        (6): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(64,), dilation=(64,))
        (7): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(128,), dilation=(128,))
      )
      (res_skip_layers): ModuleList(
        (0): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (1): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (2): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (3): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (4): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (5): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (6): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (7): Conv1d(512, 512, kernel_size=(1,), stride=(1,))
      )
      (cond_layers): ModuleList(
        (0): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (1): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (2): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (3): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (4): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (5): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (6): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (7): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
      )
      (start): Conv1d(2, 512, kernel_size=(1,), stride=(1,))
      (end): Conv1d(512, 4, kernel_size=(1,), stride=(1,))
    )
    (11): WN(
      (in_layers): ModuleList(
        (0): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(1,))
        (1): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(2,), dilation=(2,))
        (2): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(4,), dilation=(4,))
        (3): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(8,), dilation=(8,))
        (4): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(16,), dilation=(16,))
        (5): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(32,), dilation=(32,))
        (6): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(64,), dilation=(64,))
        (7): Conv1d(512, 1024, kernel_size=(3,), stride=(1,), padding=(128,), dilation=(128,))
      )
      (res_skip_layers): ModuleList(
        (0): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (1): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (2): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (3): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (4): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (5): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (6): Conv1d(512, 1024, kernel_size=(1,), stride=(1,))
        (7): Conv1d(512, 512, kernel_size=(1,), stride=(1,))
      )
      (cond_layers): ModuleList(
        (0): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (1): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (2): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (3): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (4): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (5): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (6): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
        (7): Conv1d(640, 1024, kernel_size=(1,), stride=(1,))
      )
      (start): Conv1d(2, 512, kernel_size=(1,), stride=(1,))
      (end): Conv1d(512, 4, kernel_size=(1,), stride=(1,))
    )
  )
  (convinv): ModuleList(
    (0): Invertible1x1Conv(
      (conv): Conv1d(8, 8, kernel_size=(1,), stride=(1,), bias=False)
    )
    (1): Invertible1x1Conv(
      (conv): Conv1d(8, 8, kernel_size=(1,), stride=(1,), bias=False)
    )
    (2): Invertible1x1Conv(
      (conv): Conv1d(8, 8, kernel_size=(1,), stride=(1,), bias=False)
    )
    (3): Invertible1x1Conv(
      (conv): Conv1d(8, 8, kernel_size=(1,), stride=(1,), bias=False)
    )
    (4): Invertible1x1Conv(
      (conv): Conv1d(6, 6, kernel_size=(1,), stride=(1,), bias=False)
    )
    (5): Invertible1x1Conv(
      (conv): Conv1d(6, 6, kernel_size=(1,), stride=(1,), bias=False)
    )
    (6): Invertible1x1Conv(
      (conv): Conv1d(6, 6, kernel_size=(1,), stride=(1,), bias=False)
    )
    (7): Invertible1x1Conv(
      (conv): Conv1d(6, 6, kernel_size=(1,), stride=(1,), bias=False)
    )
    (8): Invertible1x1Conv(
      (conv): Conv1d(4, 4, kernel_size=(1,), stride=(1,), bias=False)
    )
    (9): Invertible1x1Conv(
      (conv): Conv1d(4, 4, kernel_size=(1,), stride=(1,), bias=False)
    )
    (10): Invertible1x1Conv(
      (conv): Conv1d(4, 4, kernel_size=(1,), stride=(1,), bias=False)
    )
    (11): Invertible1x1Conv(
      (conv): Conv1d(4, 4, kernel_size=(1,), stride=(1,), bias=False)
    )
  )
)